# St7GetNodeHistoryFile

Returns the name of the node history file for the analysis.

long St7GetNodeHistoryFile(long uID, char* FileName, long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

MaxStringLen

Maximum number of characters allocated for FileName.

Output Parameters
FileName

Full path and name for the node history file.